[
  {
    "q": "I do not have any prior knowledge of git and/or any programming language. Can I do this?",
    "a": [
      "Absolutely. This program is specifically catered to the growth and smooth transition of people like you who want to learn. KOSS and the mentors will help you wherever possible.",
      "To learn more about git and github, check <a href='https://github.com/kossiitkgp/Git-and-Github-2021'>these</a>"
    ]
  },
  {
    "q": "What is the deadline for selecting projects? How many projects can we select?",
    "a": [
      "There is no deadline for selecting projects nor is there any restriction on the number of projects you can contribute to",
      "you can also switch between projects as much as you want. The only necessity is that you should have atleast one merged PR per week."
    ]
  },
  {
    "q": "Where does KWoC occur? Do I need to be a student of IIT Kharagpur?",
    "a": [
      "Kharagpur Winter of Code is to be done remotely from home, and it is not required for you to be student of <b>ANY</b> particular institute."
    ]
  },
  {
    "q": "What is the purpose of this program? Is this some kind of internship?",
    "a": [
      "<b>No</b>, KWoC is a program which aims at helping participants learn how to contribute in the open-source world. This activity prepares you for various open source opportunities such as <a href='https://summerofcode.withgoogle.com/archive/'>Google Summer of Code</a>, <a href='https://railsgirlssummerofcode.org'>Rail Girl's Summer of Code and Outreachy</a>."
    ]
  },
  {
    "q": "Can I participate in KWoC as both a mentor and a student?",
    "a": [
      "Yes, you can. Although we won't count your contribution to your own project. We do encourage participation into project development from everyone."
    ]
  },
  {
    "q": "What can I do to help spread the word about KWoC?",
    "a": [
      "Nothing makes us happier than people spreading words about open-source; to begin, you can connect with our <a href='https://www.facebook.com/kossiitkgp'>Facebook</a>, <a href='https://www.linkedin.com/company/kharagpur-open-source-society'>Linkedin</a>, <a href='https://twitter.com/kossiitkgp'>Twitter</a> handles and increase awareness about KWoC in your college; nothing works better than word of mouth."
    ]
  },
  {
    "q": "What if I have a question not answered in this FAQ?",
    "a": [
      "Please make sure to go through the respective manual. If after reading through it you still don't have an answer please consider reaching out to us on admin@kossiitkgp.org."
    ]
  },
  {
    "q": "How should I get selected in KWOC?",
    "a": [
      "There is absolutely no selection criteria for students. You are selected in the program as soon as you register. So you don't have to ask your mentors 'How to get selected for your project?', but instead go ahead with <b>'How can I contribute to your project?'</b>."
    ]
  },
  {
    "q": "My mentor is not replying, What should I do?",
    "a": [
      "Please be patient with your mentor(s). If you do not get a response on the communication channel, contact the mentor on their email id. If no response for 3 days, inform us."
    ]
  },
  {
    "q": "What is the last date of student registration?",
    "a": [
      "'Early bird catches the worm'",
      "Students registration deadline is 6th December. The contribution chart goes live at the same time, so be quick."
    ]
  },
  {
    "q": "My mentor is not replying, What should I do?",
    "a": [
      "Please be patient with your mentor(s). If you do not get a response on the communication channel, contact the mentor on their email id. If no response for 3 days, inform us."
    ]
  },
  {
    "q": "Can I show the contributions that I have made in KWoC for participating in any competitions?",
    "a": [
      "All the contributions that you will make in KWoC will be displayed on your GitHub timeline. So, that is a big plus if you are participating in any competitions and your GitHub profile is on display."
    ]
  },
  {
    "q": "Can I apply if I am not a student of IIT Kharagpur?",
    "a": [
      "Sure! Our program is open to <b>all</b> students irrespective of college! Is there. Read <a href='https://www.quora.com/What-is-the-prerequisite-for-participating-in-Kharagpur-Winter-of-Code-2016'>this</a> Quora answer by Pranit Bauva."
    ]
  },
  {
    "q": "Can you provide me any advice so that I can start preparing for it beforehand?",
    "a": [
      "Get familiar with git and Github. Check <a href='https://opensource.guide'>this</a> Open Source guide. Also, practice git <a href='https://gitimmersion.com/index.html'>here</a>. You can also begin by following <a href='https://www.codecademy.com/learn/learn-git'>Codecademy's git interactive tutorial</a>."
    ]
  },
  {
    "q": "Is there any other similar kind of program that I might find interesting?",
    "a": [
      "Other programs similar to KWoC are <a href='https://gssoc.girlscript.tech'>GirlScript Summer of Code</a> organised by GirlScript India. If you meant similar to GSoC, then check out <a href='https://github.com/deepanshu1422/List-Of-Open-Source-Internships-Programs'>this</a> awesome list of programs."
    ]
  },
  {
    "q": "How much time in a day do I need to give for KWoC?",
    "a": [
      "GSoC requires 40 hours per week in summers. For KWoC, you may give 1-2 hours daily and that includes conversation with your mentor(s). More the projects you contribute to, more the time in conversing about the work."
    ]
  },
  {
    "q": "Will I receive a certificate at the end of the KWoC?",
    "a": [
      "If you remain with us till the end of the program, then you'll receive a certificate for completion of the program. You would have to clear both the mid and end evaluation to get the certificate. More details can be found in our [manual](https://drive.google.com/file/d/1Bq_1tEgjBZo7g2Pi-BWuHsiCIc3aYRMe/view)"
    ]
  },
  {
    "q": "Which programming language(s) do I need to be fluent in?",
    "a": [
      "Programming languages are just like communication languages; it is sufficient to know one or two, but the more you know the better it is."
    ]
  },
  {
    "q": "Will taking part in KWoC help me in being a part of KOSS?",
    "a": [
      "If your purpose to be with us is pure, and you are deemed worthy; then yes!, provided you are a student of IIT Kharagpur."
    ]
  },
  {
    "q": "Can I work on more than one project?",
    "a": [
      "Yes! You can even work in parallel on them. Well, if you are a beginner it is advisable to focus your attention at one thing at a time. But the choice rests with you."
    ]
  },
  {
    "q": "What if I am unable to meet the deadlines due to some unavoidable reasons?",
    "a": ["Contact us via admin@kossiitkgp.org."]
  },
  {
    "q": "Will this programme help me in improving competitive coding skills or get selected for ACM ICPC?",
    "a": [
      "Participating in Open Source contribution improves your skills of software development and of a particular programming language. Depending on your project, you might be able to use some algorithms too. But you should not relate to direct improvement on your competitive coding skills."
    ]
  },
  {
    "q": "What are the minimum contributions I have to do to get successfully recognized as to have completed the programme?",
    "a": [
      "That will based on mentor's feedback. You need to have at least one merged PR by the mid-evals to be eligible for continuing the program.",
      "Atleast one more merged PR between mid and end evals and a blog post describing how you contributed!"
    ]
  },
  {
    "q": "How are commits counted?",
    "a": [
      "Commits are counted only after your PR is merged.",
      "Commits are counted if they are merged in the default branch.",
      "Commits are not linked to your github account if your email configuration is not set properly. See <a href='https://github.com/kossiitkgp/kwoc-bugs/issues/22#issuecomment-747068412'>this</a> for details."
    ]
  },
  {
    "q": "What to do,if my stats are not being updated?",
    "a": [
      "Stats are only counted once coding period starts. Check if the any of the above condition are satisfied, if the problem still persists contact us via admin@kossiitkgp.org."
    ]
  }
]
